---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotSlopeOffsetFromReference
source: html/d51719b8-2edc-4ec4-b54f-834e07a388e0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotSlopeOffsetFromReference Property

"Offset from Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotSlopeOffsetFromReference { get; }
```